which-tmnt-are-you-quiz-app/app/controllers/high_scores_controller.rb

  def create
    name = params[:name]
    score = params[:score]
    newhighscore = HighScore.new(name: name, score: score)
    if newhighscore.save
      render json: HighScore.all.order(:score).to_json
---
INSERT INTO "high_scores" ("name", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Garett"], ["score", 9], ["created_at", "2020-07-30 15:55:52.592317"], ["updated_at", "2020-07-30 15:55:52.592317"]]
SELECT "high_scores".* FROM "high_scores" ORDER BY "high_scores"."score" ASC