which-tmnt-are-you-quiz-app/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    questions = Question.all